# <font color=pink>Ferramentas utilizadas e suas versões:</font>

Pip  - 22.3.1 <br>
Visual Studio Code - 1.73.1 <br>
Python - 3.10.7 
<br><br>

<font color=pink>Bibliotecas:</font>

Pandas<br>
Numpy<br>
# <font color=pink>
---

# <font color=green> 1 - Criando DataFrame de alunos
---

In [1]:
import pandas as pd

## Utilizando <font color=green>json

In [3]:
nomes_f = pd.read_json('https://guilhermeonrails.github.io/nomes_ibge/nomes-f.json')

In [4]:
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [5]:
nomes_m = pd.read_json('https://guilhermeonrails.github.io/nomes_ibge/nomes-m.json')

In [6]:
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [7]:
nomes_f.sample(5) # sortear

          nome  regiao    freq  rank sexo
97     BARBARA       0  170703    98    F
164     MARISA       0   95961   165    F
34   CRISTIANE       0  327248    35    F
49      ANGELA       0  278058    50    F
145  FRANCIELE       0  111831   146    F

In [9]:
print('Quantidade de nomes: ' + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

## Juntando os dois DataFrames

In [10]:
frames = [nomes_f, nomes_m]

In [11]:
nomes = pd.concat(frames)['nome'].to_frame() # concatenar apenas a coluna nome

In [13]:
nomes.sample(5)

          nome
59      ISABEL
158     INGRID
160      LEILA
8     PATRICIA
35   ALEXANDRE

## Incluindo ID dos alunos

In [26]:
import numpy as np

In [27]:
np.random.seed(123)

In [29]:
total_alunos = len(nomes)

In [30]:
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1 # gera número aleatório

In [31]:
nomes

          nome  id_aluno
0        MARIA       235
1          ANA        43
2    FRANCISCA       304
3      ANTONIA       156
4      ADRIANA       343
..         ...       ...
195     WALTER       231
196    ARLINDO        99
197    MICHAEL       323
198     ALVARO       383
199    GEOVANE       366

[400 rows x 2 columns]

## Incluindo email de alunos

In [32]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']

In [33]:
nomes['dominio'] = np.random.choice(dominios, total_alunos) # escolhe email aleatório

In [34]:
nomes

          nome  id_aluno                 dominio
0        MARIA       235  @dominiodoemail.com.br
1          ANA        43     @servicodoemail.com
2    FRANCISCA       304     @servicodoemail.com
3      ANTONIA       156     @servicodoemail.com
4      ADRIANA       343     @servicodoemail.com
..         ...       ...                     ...
195     WALTER       231  @dominiodoemail.com.br
196    ARLINDO        99     @servicodoemail.com
197    MICHAEL       323  @dominiodoemail.com.br
198     ALVARO       383     @servicodoemail.com
199    GEOVANE       366     @servicodoemail.com

[400 rows x 3 columns]

In [35]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [36]:
nomes

,nome,id_aluno,dominio,email
0,MARIA,235,@dominiodoemail.com.br,maria@dominiodoemail.com.br
1,ANA,43,@servicodoemail.com,ana@servicodoemail.com
2,FRANCISCA,304,@servicodoemail.com,francisca@servicodoemail.com
3,ANTONIA,156,@servicodoemail.com,antonia@servicodoemail.com
4,ADRIANA,343,@servicodoemail.com,adriana@servicodoemail.com
...,...,...,...,...
195,WALTER,231,@dominiodoemail.com.br,walter@dominiodoemail.com.br
196,ARLINDO,99,@servicodoemail.com,arlindo@servicodoemail.com
197,MICHAEL,323,@dominiodoemail.com.br,michael@dominiodoemail.com.br
198,ALVARO,383,@servicodoemail.com,alvaro@servicodoemail.com
199,GEOVANE,366,@servicodoemail.com,geovane@servicodoemail.com